package ua.tarastom.gufi.utils;

import com.google.firebase.firestore.FirebaseFirestore;

import java.util.ArrayList;
import java.util.List;

import ua.tarastom.gufi.model.Service;

public class HelpDB {
    public static void main(String[] args) {
        Service service1 = new Service(
                1, "Макияж", "Наталия", "Мастер",
                "Петренко", "женский", "0672672598", "http://test",
                "Полная оплата", "С 08:00 до 16:00 в будни", "Есть выезд к клиенту на дом"
        );

        Service service2 = new Service(
                2, "Макияж", "Ольга", "Мастер",
                "Мванова", "женский", "0689672345", "http://test",
                "Частичная оплата", "С 10:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service3 = new Service(
                3, "Макияж", "Марина", "Мастер",
                "Доба", "женский", "0978456324", "http://test",
                "Полная оплата", "С 11:00 до 14:00 в выходные", "Есть выезд к клиенту на дом"
        );
        Service service4 = new Service(
                4, "Макияж", "Светлана", "Мастер",
                "Петрова", "женский", "0998947563", "http://test",
                "Частичная оплата", "С 10:00 до 21:00 в выходные", "Есть выезд к клиенту на дом"
        );

        Service service5 = new Service(
                5, "Макияж", "Ирина", "Мастер",
                "Кузнецова", "женский", "06825475142", "http://test",
                "Полная оплата", "С 09:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );

        Service service6 = new Service(
                6, "Макияж", "Илона", "Мастер",
                "Соколова", "женский", "06825475142", "http://test",
                "Полная оплата", "С 09:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service7 = new Service(
                7, "Макияж", "София", "Мастер",
                "Александрова", "женский", "0685471234", "http://test",
                "Частичная оплата", "С 08:00 до 16:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service8 = new Service(
                8, "Макияж", "Виктория", "Мастер",
                "Антонова", "женский", "06985745632", "http://test",
                "Частичная оплата", "С 08:00 до 16:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service9 = new Service(
                9, "Макияж", "Ксения", "Мастер",
                "Борисова", "женский", "0676843274", "http://test",
                "Полная оплата", "С 09:00 до 17:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service10 = new Service(
                10, "Макияж", "Дарья", "Мастер",
                "Данилова", "женский", "0673241212", "http://test",
                "Полная оплата", "С 09:00 до 17:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service11 = new Service(
                11, "Маникюр, педикюр", "Дмитрий", "Мастер",
                "Воронин", "мужской", "0674875151", "http://test",
                "Частичная оплата", "С 09:00 до 17:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service12 = new Service(
                12, "Депиляция", "Анна", "Мастер",
                "Глухова", "женский", "0665413794", "http://test",
                "Частичная оплата", "С 09:00 до 17:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service13 = new Service(
                13, "Маникюр с покрытием", "Вероника", "Мастер",
                "Демина", "женский", "0668736941", "http://test",
                "Полная оплата", "С 09:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service14 = new Service(
                14, "Услуги грузчиков", "Максим", "Мастер",
                "Усов", "мужской", "0664381564", "http://test",
                "Полная оплата", "С 09:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service15 = new Service(
                15, "SPA", "Кира", "Мастер",
                "Воронова", "женский", "0676502136", "http://test",
                "Полная оплата", "С 10:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service16 = new Service(
                16, "SPA", "Кира", "Мастер",
                "Воронова", "женский", "0676502136", "http://test",
                "Полная оплата", "С 10:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service17 = new Service(
                17, "Доставка воды", "Матвей", "Мастер",
                "Михайлов", "мужской", "0681020103", "http://test",
                "Полная оплата", "С 10:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service18 = new Service(
                18, "Риелторские услуги", "Артём", "Мастер",
                "Назаров", "мужской", "0974846314", "http://test",
                "Полная оплата", "С 08:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service19 = new Service(
                19, "Юридические услуги", "Даниил", "Мастер",
                "Сергеев", "мужской", "0977910345", "http://test",
                "Частичная оплата", "С 08:00 до 18:00 в выходные", "Есть выезд к клиенту на дом"
        );
        Service service20 = new Service(
                20, "Наращивание ногтей", "Варвара", "Мастер",
                "Галкина", "женский", "0987612374", "http://test",
                "Частичная оплата", "С 09:00 до 16:00 в выходные", "Есть выезд к клиенту на дом"
        );
        Service service21 = new Service(
                21, "Наращивание ногтей", "Варвара", "Мастер",
                "Галкина", "женский", "0987612374", "http://test",
                "Частичная оплата", "С 09:00 до 16:00 в выходные", "Есть выезд к клиенту на дом"
        );
        Service service22 = new Service(
                21, "Архитектура бровей", "Виктория", "Мастер",
                "Гришина", "женский", "0996874512", "http://test",
                "Частичная оплата", "С 09:00 до 16:00 в выходные", "Есть выезд к клиенту на дом"
        );
        Service service23 = new Service(
                23, "Макияж", "Buty-B", "Студия",
                "", "", "0672672598", "http://test",
                "Полная оплата", "С 08:00 до 16:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service24 = new Service(
                24, "Макияж", "Nails-pro", "Студия",
                "", "", "0674812475", "http://test",
                "Полная оплата", "С 08:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service25 = new Service(
                25, "Макияж", "BestGrow", "Студия",
                "", "", "0674745541", "http://test",
                "Полная оплата", "С 08:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service26 = new Service(
                26, "Макияж", "Bird", "Студия",
                "", "", "0671123541", "http://test",
                "Полная оплата", "С 08:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service27 = new Service(
                27, "Макияж", "Fox", "Студия",
                "", "", "069632541", "http://test",
                "Полная оплата", "С 08:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service28 = new Service(
                28, "Макияж", "Радуга", "Студия",
                "", "", "0636874125", "http://test",
                "Частичная оплата", "С 09:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service29 = new Service(
                29, "Макияж", "Панорама", "Студия",
                "", "", "06378945612", "http://test",
                "Частичная оплата", "С 09:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        Service service30 = new Service(
                30, "Макияж", "Сити-косметикс", "Студия",
                "", "", "0638745632", "http://test",
                "Частичная оплата", "С 09:00 до 18:00 в будни", "Есть выезд к клиенту на дом"
        );
        List<Service> services = new ArrayList<>();
        services.add(service1);
        services.add(service2);
        services.add(service3);
        services.add(service4);
        services.add(service5);
        services.add(service6);
        services.add(service7);
        services.add(service8);
        services.add(service9);
        services.add(service10);
        services.add(service11);
        services.add(service12);
        services.add(service13);
        services.add(service14);
        services.add(service15);
        services.add(service16);
        services.add(service17);
        services.add(service18);
        services.add(service19);
        services.add(service21);
        services.add(service22);
        services.add(service23);
        services.add(service24);
        services.add(service25);
        services.add(service26);
        services.add(service27);
        services.add(service28);
        services.add(service29);
        services.add(service30);

        FirebaseFirestore db = FirebaseFirestore.getInstance();
        for (Service service : services) {
//            db.collection("services").add(service);
        }
    }
}
